IDEA Open Model
MatConcreteSIA.AggregateType Property
Compatible with IDEA StatiCa v 10.1
 type of aggregate
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public ConcAggregateTypeSIA AggregateType { get; set; }
Public Property AggregateType As ConcAggregateTypeSIA
	Get
	Set
public:
property ConcAggregateTypeSIA AggregateType {
	ConcAggregateTypeSIA get ();
	void set (ConcAggregateTypeSIA value);
}
Property Value
Type: ConcAggregateTypeSIA
See Also
Reference
MatConcreteSIA Class
IdeaRS.OpenModel.Material Namespace